# TogglePinMember Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss..::..TogglePinMember Method
Truss Class See Also
---
Pin/Unpin a truss member.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void TogglePinMember(
	ElementId elemId
)
```

Visual Basic
---
```text
Public Sub TogglePinMember ( _
	elemId As ElementId _
)
```

Visual C++
---
```text
public:
void TogglePinMember(
	ElementId^ elemId
)
```

# ### Parameters
elemId
    Type: Autodesk.Revit.DB..::..ElementIdThe member element is going to pin/unpin.
# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace